--- a/_posts/2019-05-02-04_Basic_Repo_Insertion_Protocol.md
+++ b/_posts/2019-05-02-04_Basic_Repo_Insertion_Protocol.md
@@ -124,41 +124,50 @@ EndBlockId Missing Timeout 타이머가 시작되면 Repo 는 17 ~ 26 단계에�
 
 ### Protocol diagram:
 
-```mermaid
-sequenceDiagram
-Requester-->>Repo: Insert command
-activate Requester
-deactivate Requester
-activate Repo
-Repo-->>Requester: Confirm start/Reject command (with status code)
-activate Requester
-deactivate Requester
-deactivate Repo
-
-Repo-->>Data producer: Interest for Data
-activate Repo
-deactivate Repo
-activate Data producer
-Data producer-->>Repo: Data segment
-activate Repo
-deactivate Data producer
-deactivate Repo
-
-Repo-->>Data producer: Interest for Data
-activate Repo
-deactivate Repo
-activate Data producer
-Data producer-->>Repo: Data segment
-activate Repo
-deactivate Data producer
-deactivate Repo
-
-Requester-->>Repo: Status interest
-activate Requester
-deactivate Requester
-activate Repo
-Repo-->>Requester: Status response
-activate Requester
-deactivate Requester
-deactivate Repo
+```
+Requester                     Repo                          Data producer
+    |                           |                                 |
+    |                           |                                 |
+  +---+  Insert command       +---+                               |
+  |   | --------------------> |   |                               |
+  +---+                       |   |                               |
+    |                         |   |                               |
+  +---+   Confirm start       |   |                               |
+  |   | <==================== |   |                               |
+  +---+   Reject command      +---+                               |
+    |     (with status code)    |                                 |
+    |                         +---+     Interest for Data       +---+
+    |                         |   | --------------------------> |   |
+    |                         +---+                             |   |
+    |                           |                               |   |
+    |                         +---+       Data segment          |   |
+    |                         |   | <========================== |   |
+    |                         +---+                             +---+
+    |                           |                                 |
+    |                           ~                                 ~
+    |                           ~                                 ~
+    |                           |                                 |
+    |                         +---+     Interest for Data       +---+
+    |                         |   | --------------------------> |   |
+    |                         +---+                             |   |
+    |                           |                               |   |
+    |                         +---+       Data segment          |   |
+    |                         |   | <========================== |   |
+    |                         +---+                             +---+
+    |                           |                                 |
+    |                           |                                 |
+    |                           ~                                 ~
+    |                           ~                                 ~
+    |                           |                                 |
+    |                           |                                 |
+    |                           |                                 |
+  +---+   Status interest     +---+                               |
+  |   | --------------------> |   |                               |
+  +---+                       |   |                               |
+    |                         |   |                               |
+  +---+    Status response    |   |                               |
+  |   | <==================== |   |                               |
+  +---+                       +---+                               |
+    |                           |                                 |
+    |                           |                                 |
 ```
